Tekla Open API Reference for Tekla Structures 2025
ViewAttributes Properties
The View.ViewAttributes type exposes the following members.
Properties
Name | Description
DatumLevel
 The specified datum level. If ViewPlaneDatumPointForElevations is set to true when DatumLevel is set, the value of ViewPlaneDatumPointForElevations will change to false.
FixedViewPlacing
 Defines whether the view placing is fixed (true) or free (false).
LabelPositionHorizontal
 The horizontal position of the view label.
LabelPositionVertical
 The vertical position of the view label.
LocationBy
 Gets or sets the location by attribute. Value is ViewAttributes.LocationByModelOrigin, ViewAttributes.LocationByProjectBasePoint or guid of a Basepoint.
MarkSymbolAttributes
 The view mark symbol attributes.
MarkSymbolColor
 The color of the mark symbol (see DrawingColors for options).
PartialProfileLength
 Gets or sets the partial profile length.
PartialProfileOffset
 Gets or sets the partial profile offset
PourView
 Defines whether the view is pour view or not.
ReflectedView
 Defines whether the view is reflected or not.
Scale
 The view scale.
Shortening
 Gets or sets the shortening attributes for the view.
ShowPartOpeningsOrRecessSymbol
 Defines whether to show the openings/recess symbol or not.
TagsAttributes
 The attributes for view mark tags.
TrueMarkSymbolColor
 The true color (rgb enabled) of the mark symbol.
UndeformedView
 Defines whether the view is undeformed or not.
UnfoldedView
 Defines whether the view is unfolded or not.
ViewExtensionForNeighbourParts
 The view extension for neighbour parts.
ViewPlaneDatumPointForElevations
 Defines whether the datum point for elevations is view plane based (true) or specified (false). When set to false, the value of DatumLevel is used. When set to true, DatumLevel will be set to 0.0.
Top
See Also
Reference
View.ViewAttributes Class
Tekla.Structures.Drawing Namespace